Repository: Slipfaith/tmragger
Catalog: sample-tmx/HW_Marketing_en-US_pt-PT_repaired.tmx
Source language: en_us
Languages: pt_pt

source: Beat dozens of levels, test the new Guardian’s healing talents in fights against bosses, and help him become a true hero!
pt_pt: Completa dezenas de níveis, testa os talentos de cura do novo Guardião em lutas contra bosses e ajuda-o a tornar-se um verdadeiro herói!

source: FIGHT THE BOSS!
pt_pt: DERROTA O BOSS!

source: CLIMB AND FIGHT!
pt_pt: SOBE E LUTA!

source: ATTACK!
pt_pt: ATACA!

source: CRUSH THEM ALL!
pt_pt: ESMAGA-OS TODOS!

source: MOVE!
pt_pt: CORRE!

source: CHOOSE WISELY!
pt_pt: ESCOLHE BEM!

source: The Emerald Fever!
pt_pt: A Febre das Esmeraldas!

source: Get great offers & prepare for the Tournament!
pt_pt: Apanha ótimas ofertas e prepara-te para o Torneio!

source: Grab emeralds every day & get maximum value!
pt_pt: Compra esmeraldas todos os dias para máximo valor!

source: And while you’re at it, upgrade your Titans to win the Tournament of Power!
pt_pt: E melhora os teus Titãs para ganhares o Torneio do Poder!

source: Get x4 emeralds from all offers!
pt_pt: Ganha 4x mais esmeraldas em cada oferta!

source: Shop & prepare your Titans for the Tournament!
pt_pt: Prepara os teus Titãs para o Torneio!

source: Launch the game every day and get 4 times the emeralds from any offer!
pt_pt: Inicia o jogo todos os dias e ganha 4 vezes mais esmeraldas em qualquer oferta!

source: Stock up on resources, upgrade your Heroes, and participate in the Tournament of Titan Power.
pt_pt: Compra recursos, melhora os teus Heróis e participa no Torneio do Poder Titã.

source: Get the best score you can for growing the strength of your Heroes and lead your group to victory!
pt_pt: Alcança a melhor pontuação possível para aumentares a força dos teus Heróis e levares o teu grupo à vitória!

source: An Epic Update!
pt_pt: Atualização Épica!

source: Daughters of Zeus New mythological skins will turn Peech & Dark Star into Greek goddesses!
pt_pt: Filhas de Zeus Novos visuais mitológicos irão transformar Peech e Estrela Sombria em deusas!

source: Peech’s outfit can also be upgraded to make it twice as easy for her to crush enemies!
pt_pt: A roupa de Peech pode ser melhorada para que consiga esmagar os inimigos com facilidade!

source: Faces of Evil Get ready to meet reimagined demons!
pt_pt: Faces do Mal Prepara-te para conhecer novos demónios!

source: Don’t let their magnificent appearances fool you: inside, they're just as evil as before!
pt_pt: Não te deixes enganar pela sua aparência: por dentro, são tão malignos como antes!

source: Arena News Now, the higher your league, the higher your rank will stay after the season-end reset!
pt_pt: Novidades da Arena Agora, quanto maior a liga, maior a tua classificação!

source: Inscribe your name in the history books of the Dominion!
pt_pt: Coloca o teu nome nos livros de história de Domínio!

source: Get stronger with Peech!
pt_pt: Torna-te mais forte com Peech!

source: Stock up on resources and increase your might!
pt_pt: Obtém recursos e eleva o teu poder!

source: Captivating quests, deals, and an opportunity to buy souls for Peech and the Heroes of the Way of Chaos await!
pt_pt: Missões cativantes, ofertas e uma oportunidade de comprar almas para Peech e para os Heróis do Caminho do Caos!

source: Discounts up to 65% and four times more resources!
pt_pt: Descontos até 65% e quatro vezes mais recursos!

source: Increase your might!
pt_pt: Eleva o teu poder!

source: A crazy sale in Dominion!
pt_pt: Uma promoção louca no Domínio!

source: Don’t miss an opportunity to buy souls for Peech and the Heroes of the Way of Chaos!
pt_pt: Não percas a oportunidade de comprar almas para Peech e para os Heróis do Caminho do Caos!

source: Chests discounts up to 55% and featured items discounts up to 65%, as well as 4 times more resources from any offer are waiting for you!
pt_pt: Descontos em baús até 55% e descontos em artigos em destaque até 65%, além de 4 vezes mais funcionalidades de qualquer oferta estão à tua espera!

source: Become stronger and turn battles with your enemies into a true show—for the most dedicated fans Peech has prepared two avatars and a stylish circus frame!
pt_pt: Torna-te mais forte e transforma as batalhas contra os teus inimigos num verdadeiro espetáculo — para os fãs mais dedicados, Peech preparou dois avatares e uma elegante moldura de circo!

source: New Skins!
pt_pt: Novos Visuais!

source: Hero of Myth Sebastian joins the pantheon of Greek gods!
pt_pt: Herói do Mito Sebastian junta-se ao panteão dos deuses Gregos!

source: Don’t miss the chance to buy a new Mythical Skin for this charming musician!
pt_pt: Não percas a oportunidade de comprar um novo Visual Mítico para este encantador músico!

source: Hero of the Gym Hey, it seems Tristan got busy and really worked on his beach bod!
pt_pt: Herói do Ginásio Ei, parece que o Tristan esteve ocupado e trabalhou para obter o seu corpo de praia!

source: He’s well handsome, muscular, and—most importantly—stylish!
pt_pt: É bonito, musculado e, o mais importante, estiloso!

source: Oh yeah, it must be his new Sport Skin.
pt_pt: Ah pois, deve ser o seu novo Visual Desportivo.

source: Hurry and add it to your collection!
pt_pt: Corre e adicione-o à tua coleção!

source: Transform your Heroes and turn the tide of battle!
pt_pt: Transforma os teus heróis e altera o rumo da batalha!

source: Emeralds Galore!
pt_pt: Esmeraldas em abundância!

source: It's time to stock up on this valuable currency!
pt_pt: Está na hora de armazenar esta valiosa moeda!

source: Generous Emerald offers every day!
pt_pt: Ofertas generosas de Esmeraldas todos os dias!

source: Get the best value and get ready for future adventures!
pt_pt: Obtém o melhor valor e prepara-te para futuras aventuras!

source: 4 times more Emeralds with every lot!
pt_pt: 4 vezes mais Esmeraldas com cada lote!

source: Time to stock up!
pt_pt: Está na hora de armazenar!

source: Don't miss out on the x4 offer on all Emerald lots!
pt_pt: Não percas a oferta x4 em todos os lotes de Esmeraldas!

source: Offers refresh every day.
pt_pt: As ofertas são atualizadas todos os dias.

source: Log in to the game and get quadruple value!
pt_pt: Entra no jogo e ganha o quádruplo do valor!

source: Stock up on Emeralds to unlock chests, buy Energy for campaigns, upgrade your Heroes, and get fully armed for new adventures!
pt_pt: Abastece-te com Esmeraldas para desbloqueares baús, comprares Energia para campanhas, melhorares os teus Heróis e ficares totalmente armado para novas aventuras!

source: FIGHT AND WIN!
pt_pt: LUTA E VENCE!

source: Campaign
pt_pt: Campanha

source: Quests
pt_pt: Missões

source: Events
pt_pt: Eventos

source: Hero Arena
pt_pt: A Arena do Herói

source: Gate
pt_pt: Portão

source: Heroic Chest
pt_pt: Baú Heróico

source: 4x Sale
pt_pt: Descontos 4x

source: Hero Power
pt_pt: Poder do Herói

source: Equipment Rank
pt_pt: Classificação do Equipamento

source: PICK A TEAM!
pt_pt: ESCOLHE UMA EQUIPA!

source: Heroes
pt_pt: Heróis

source: Difficulty:
pt_pt: Dificuldade:

source: Impossible
pt_pt: Impossível

source: Get New Angelic Skins
pt_pt: Obtém Novos Visuais Angelicais

source: Give Alvanor and Tempus heavenly powers!
pt_pt: Dá poderes celestiais a Alvanor e Tempus!

source: Win any battle with the new Skins!
pt_pt: Vence qualquer batalha com os novos Visuais!

source: Tempus’s Skin can also be upgraded to double his armor!
pt_pt: O Visual de Tempus também pode ser melhorado para duplicar a sua armadura!

source: Get the new angelic Skins for Alvanor and Tempus!
pt_pt: Obtém os novos Visuais angelicais para Alvanor e Tempus!

source: Obtain the power of heavens!
pt_pt: Obtém o poder dos céus!

source: Angelic Skins for Alvanor and Tempus are only available for 3 days!
pt_pt: Os Visuais Angelicais para Alvanor e Tempus estão disponíveis apenas durante 3 dias!

source: You’ll surely win any battle with them.
pt_pt: Irás vencer qualquer batalha com eles.

source: And Tempus’s upgraded Skin doubles his armor!
pt_pt: E o Visual melhorado de Tempus duplica a sua armadura!

source: Upgrade your Heroes, discover their divine potential, and defeat anyone standing in your way!
pt_pt: Melhora os teus heróis, descobre o teu potencial divino e derrota qualquer um que se atravesse no teu caminho!

source: New Talisman for Folio You thought words were the strongest weapon?
pt_pt: Novo Talismã para Folio Pensavas que as palavras eram a arma mais poderosa?

source: Think again!
pt_pt: Volta a pensar!

source: Folio just got a new Talisman, and now he hits even harder.
pt_pt: Folio acaba de obter um novo Talismã, e agora bate ainda com mais força.

source: It's time to turn a new page in his life!
pt_pt: Está na hora de virar uma nova página na sua vida!

source: Solaris's Primordial Skin Solaris shines so bright that enemies go blind before the fight even begins.
pt_pt: Visual Primordial de Solaris Solaris brilha tanto que os inimigos ficam cegos antes mesmo de a luta começar.

source: Unlock her new Primordial Skin and outshine them all!
pt_pt: Desbloqueia o teu novo Visual Primordial e supera todos!

source: Lara Croft is back!
pt_pt: Lara Croft está de volta!

source: The legendary heroine is on your team!
pt_pt: A lendária heroína está na tua equipa!

source: Mysteries and challenges await!
pt_pt: Os mistérios e desafios esperam por ti!

source: Upgrade Lara with artifacts and a Talisman, try out unique Skins, and obtain valuable trophies!
pt_pt: Melhora-a com artefactos e um Talismã, experimenta Visuais e ganha troféus!

source: The legendary heroine is on your team.
pt_pt: A lendária heroína está na tua equipa.

source: Embark on an exciting adventure with a cult heroine!
pt_pt: Embarca numa aventura emocionante com esta heroína!

source: True challenges and mysteries wait ahead!
pt_pt: Verdadeiros desafios e mistérios esperam por ti!

source: Be prepared: artifacts, Soul Stones, and a special Talisman for Lara Croft will surely help you on this journey.
pt_pt: Está preparado: artefactos, Pedras Anímicas e um Talismã especial para Lara Croft vão certamente ajudar-te nesta viagem.

source: Upgrade the heroine and help her in her quest for truth.
pt_pt: Melhora a heroína e ajude-a na sua luta pela verdade.

source: During the event, there will be valuable resources, unique Skins, and a lot of other surprises!
pt_pt: Durante o evento, haverá recursos valiosos, Visuais exclusivos e muitas outras surpresas!

source: Don’t miss out on this rare opportunity!
pt_pt: Não percas esta oportunidade rara!

source: Welcome to the Emerald August!
pt_pt: Bem-vindo ao Agosto Esmeralda!

source: Don’t miss out on these sparkling new offers!
pt_pt: Não percas estas novas ofertas incríveis!

source: Forecasters are predicting an emerald rain!
pt_pt: Os meteorologistas estão a prever uma chuva esmeralda!

source: Hurry to open Matryoshkas and get the most value from every lot!
pt_pt: Apressa-te a abrir as Matrioscas e aproveita ao máximo cada lote!

source: Emerald Matryoshkas at 65% off and a 4x bonus on all lots!
pt_pt: Matrioscas Esmeralda com 65% de desconto e 4x bónus em todos os lotes!

source: But this generous weather won’t last long—make the most of it while you can!
pt_pt: Mas este clima generoso não vai durar muito - aproveite-o enquanto podes!

source: Open Emerald Matryoshkas at a 65% discount and get 4 times more Emeralds from every lot!
pt_pt: Abre as Matrioscas Esmeralda com 65% de desconto e ganha 4 vezes mais Esmeraldas com cada lote!

source: Stock up on this precious currency and strengthen your team to stand firm against any opponent!
pt_pt: Abastece-te com esta preciosa moeda e fortalece a tua equipa para que possas resistir a qualquer adversário!

source: Meet a new Hero—Somna
pt_pt: Conhece um novo Herói - Somna

source: Defeat mighty bosses & learn the she-wolf’s story!
pt_pt: Derrota os inimigos e conhece a história da loba!

source: Endless waves of enemies await you in the new Adventure.
pt_pt: Ondas infinitas de inimigos esperam por ti na nova Aventura.

source: Put them to sleep using Somna’s skills and achieve victory!
pt_pt: Põe-nos a dormir com as habilidades de Somna e vence!

source: A new Hero—Somna—is here!
pt_pt: Uma nova heroína, Somna, está aqui!

source: Fight the bosses and uncover the she-wolf’s story!
pt_pt: Luta contra inimigos e vem conhecer a loba!

source: Somna has turned her back on fighting and learned to painlessly put her enemies to sleep, but her peace was not to last...
pt_pt: Somna virou costas à luta e aprendeu a fazer os seus inimigos adormecerem sem dor, mas a sua paz não iria durar...

source: In the new Adventure, you will delve into the former warrior’s story and restore the balance between dreams and reality!
pt_pt: Na nova Aventura, irás mergulhar na história do antigo guerreiro e irás restabelecer o equilíbrio entre o sonho e a realidade!

source: Overcome waves of enemies and put even the mightiest bosses to sleep.
pt_pt: Supera ondas de inimigos e coloca até os inimigos mais poderosos a dormir.

source: Nobody can escape Somna’s lullaby!
pt_pt: Ninguém consegue escapar à canção de embalar de Somna!

source: Walk the hero's way!
pt_pt: Segue o caminho do herói!

source: Obtain all the Battle Pass trophies!
pt_pt: Obtém todos os troféus do Passe da Batalha!

source: Complete tasks and collect resources!
pt_pt: Conclui tarefas e recolhe recursos!

source: The Premium version will provide even more trophies and a Solar Skin for Xe’Sha!
pt_pt: A versão Premium irá fornecer ainda mais troféus e um Visual Solar para Xe’Sha!

source: Walk the hero's way and obtain all the Battle Pass trophies!
pt_pt: Segue o caminho do herói e obtém todos os troféus do Passe da Batalha!

source: Welcome the summer adventures!
pt_pt: Bem-vindos às aventuras de verão!

source: Complete the “Hero’s Way” tasks and collect resources.
pt_pt: Conclui as tarefas do “Caminho do Herói” e recolhe recursos.

source: The Premium version of the Pass will open up the way to the Grand Prizes for you—even more trophies and a unique Solar Skin for Xe’Sha that strengthens her magic crit!
pt_pt: A versão Premium do Passe irá abrir-te o caminho para os Grandes Prémios: ainda mais troféus e um Visual Solar exclusivo para Xe'Sha que fortalece o seu golpe mágico!

source: Challenge yourself—reach the end of the journey and become the hero of the summer!
pt_pt: Desafia-te, chega ao fim da viagem e torna-te no herói do verão!

source: Summer starts with new Skins!
pt_pt: Verão significa novos Visuais!

source: Get new Solar Skins for Soleil and Phobos!
pt_pt: Recebe novos Visuais Solares para Soleil e Phobos!

source: Sunny days have come to Dominion!
pt_pt: Os dias de sol chegaram a Domínio!

source: And where there is hot weather there are hot deals: new Solar Skins for Soleil and Phobos will be available only for 3 days!
pt_pt: E onde há calor, há boas ofertas: os novos Visuais Solares para Soleil e Phobos estarão disponíveis apenas durante 3 dias!

source: Let your summer be bright!
pt_pt: Que o teu verão seja brilhante!

source: Oya the Huntress is here!
pt_pt: Oya, a Caçadora, está aqui!

source: Formidable bosses are just prey to her!
pt_pt: Os inimigos ​​são presas fáceis para ela!

source: Embark on an Adventure in the depths of the jungle with a princess of a forgotten tribe and learn the ancient prophecy!
pt_pt: Embarca numa Aventura nas profundezas da selva com uma princesa de uma tribo esquecida e conhece uma antiga profecia!

source: The hunt is on!
pt_pt: A caça começou!

source: Oya is here!
pt_pt: Oya está aqui!

source: Make all enemies fall before her onslaught!
pt_pt: Faz cair todos os inimigos perante o seu ataque!

source: A new Adventure will transport you into the depths of the jungle!
pt_pt: Uma nova Aventura irá transportar-te para as profundezas da selva!

source: Enemies will be lying in wait everywhere, but Oya’s talents will instantly turn them into prey!
pt_pt: Os inimigos estarão à espreita em todo o lado, mas os talentos de Oya transformá-los-ão instantaneamente em presas!

source: Join the princess of the forgotten tribe, defeat dangerous bosses, and help her accept the burden of being a chieftain!
pt_pt: Junta-te à princesa da tribo esquecida, derrota os perigosos inimigos e ajuda-a a aceitar o facto de ser uma chefe!

source: Don’t miss the new Skins—and an all-new game mode!
pt_pt: Não percas os novos Visuais e um modo de jogo totalmente novo!

source: Andvari scores big!
pt_pt: Andvari é um privilegiado!

source: Andvari gets his Sport Skin—ready to smash!
pt_pt: Andvari ganha o seu Visual Desportivo e está pronto para arrasar!

source: What do Folio and Xe’Sha have in common?
pt_pt: O que têm Folio e Xe’Sha em comum?

source: They both shine brighter than ever with their new Solar Skins!
pt_pt: Ambos brilham mais do que nunca com os seus novos Visuais Solares!

source: Tempus got it right on time!
pt_pt: Tempus acertou em cheio!

source: Tempus gains his second Talisman—perfect timing!
pt_pt: Tempus ganha o seu segundo Talismã no momento perfeito!

source: New horizons!
pt_pt: Novos horizontes!

source: ETERNAL FRONTIER is coming.
pt_pt: FRONTEIRA ETERNA está a chegar.

source: You’ve waited long enough…
pt_pt: Já esperas-te o suficiente…

source: The Campaign continues soon.
pt_pt: A Campanha continua em breve.

source: Get ready.
pt_pt: Prepara-te.

source: A hot update packed with more Skins, a new Hero, and fresh content.
pt_pt: Nova atualização com Visuais, conteúdo e um Herói!

source: Let’s go!
pt_pt: Bora!

source: Folio goes full radiant!
pt_pt: Folio está radiante!

source: His Solar Skin now lights up the Seer's Game—get it now!
pt_pt: O seu Visual Solar ilumina o Jogo da Vidente. Compra já!

source: Darkness doesn’t stand a chance!
pt_pt: A escuridão não tem hipótese!

source: Soleil and Phobos shine in the Sunny Days sale with brand-new looks.
pt_pt: Soleil e Phobos brilham nos descontos dos Dias Ensolarados, com novos visuais!

source: Phobos is also getting a Skin+ and fully reworked visuals!
pt_pt: Phobos recebe também um Visual+ e um design refeito!

source: Tempus nailed it again!
pt_pt: Tempus voltou a acertar em cheio!

source: A second Talisman unlocked—tick-tock!
pt_pt: Um segundo Talismã desbloqueado: tique-toque!

source: Meet the dreamer of the stars!
pt_pt: Conhece a sonhadora das estrelas!

source: New Hero Somna joins the fight.
pt_pt: A nova heroína Somna entra em ação.

source: Get her Space Skin from the Season Pass!
pt_pt: Obtém o seu Visual Espacial do Passe de Temporada!

source: Suit up—this update's packed with new power-ups.
pt_pt: Prepara-te - esta atualização está repleta de novos potenciadores.

source: Extra-Terrestrial update!
pt_pt: Atualização Extraterrestre!

source: Arachne (with a Skin+), Helios, and Amira get new Space Skins.
pt_pt: Arachne (com um Visual+), Helios e Amira ganham novos Visuais Espaciais.

source: Arachne reworked.
pt_pt: Arachne retrabalhada.

source: She's got a rebalance and updated visuals to match.
pt_pt: Ela recebeu um rebalanceamento e visuais atualizados para combinar.

source: Oya hits the field!
pt_pt: Oya entra em campo!

source: A brand-new Sports Skin is now available.
pt_pt: Um novo Visual Desportivo já está disponível.

source: Time for a trick.
pt_pt: É hora de um truque.

source: Peech scores her second Talisman—and it's no joke!
pt_pt: Peech ganha o seu segundo Talismã - e não é uma brincadeira!

source: New red gear.
pt_pt: Novo equipamento vermelho.

source: A fresh red gear pack is now up for grabs!
pt_pt: Um novo pacote com equipamento vermelho já está disponível para ti!

source: A blazing update packed with delight.
pt_pt: Uma atualização incrível.

source: Let’s roll!
pt_pt: Bora lá!

source: Stars align for Arachne!
pt_pt: Os astros alinham-se para Arachne!

source: She gets a full rebalance and blasts off with her new Space Skin — plus a dazzling Skin+!
pt_pt: Recebe um ajuste completo, um novo Visual Especial e um Visual+ estrondoso!

source: Kai is transforming!
pt_pt: Kai está a transformar-se!

source: A full rework plus a brand-new Adventure for the elf mage.
pt_pt: O elfo recebe uma renovação e uma nova Aventura.

source: New Fire Titan arrives!
pt_pt: Chegou um novo Titã de Fogo!

source: Meet Asherona, who is ready to ignite the fight.
pt_pt: Conhece Asherona, que vem reacender a guerra.

source: More New Skins!
pt_pt: Novos Visuais!

source: Helios and Amira join the party with new Space looks.
pt_pt: Helios e Amira juntam-se à festa com novos visuais Espaciais.

source: Earth Titans Sylva and Angus receive new skins.
pt_pt: Os Titãs da Terra Sylva e Angus recebem novos visuais.

source: Cascade’s Harvest Skin blooms in the Season Pass.
pt_pt: O Visual da Colheita de Cascade floresce no Passe de Temporada.

source: YOU HAVE ONLY 2 MOVES
pt_pt: SÓ TENS DUAS JOGADAS

source: IQ:
pt_pt: QI:

source: TRY
pt_pt: TENTA

source: IT'S YOUR CHOICE!
pt_pt: A ESCOLHA É TUA!

source: KILL THE GOBLIN!
pt_pt: MATA O DUENDE!

source: CAN YOU WIN?
pt_pt: CONSEGUES VENCER?

source: ONLY 3% CAN SOLVE IT!
pt_pt: APENAS 3% CONSEGUEM VENCER!

source: Harvest’s here — and so is the gear!
pt_pt: A Colheita chegou — e o equipamento também!

source: Kai gets a new Harvest Skin and a Skin+.
pt_pt: Kai ganha um novo Visual de Colheita e um Visual+.

source: A Relic rises!
pt_pt: Uma Relíquia emerge!

source: Folio unlocks a new Relic — time to bring the power!
pt_pt: Folio desbloqueia uma nova Relíquia — está na hora de trazer o poder!

source: Polaris suits up too!
pt_pt: Polaris também se prepara!

source: A Harvest Skin and a brand-new Talisman — fresh from the fields.
pt_pt: Um Visual de Colheita e um Talismã novinho em folha — diretamente dos campos.

source: Alliance Fantasy is a free to play game.
pt_pt: Alliance Fantasy é um jogo gratuito.

source: However, some in-game items can also be purchased for real money, including loot boxes that drop available items in random order.
pt_pt: No entanto, alguns itens dentro jogo também podem ser comprados com dinheiro real, incluindo caixas que dão itens numa ordem aleatória.

source: You can find all information about drop rates by selecting a corresponding info button.
pt_pt: Podes encontrar todas as informações sobre a probabilidade que cada item tem de ser sair, selecionando o botão de informação correspondente.

source: A bountiful harvest...
pt_pt: Uma colheita abundante...

source: with a dark twist!
pt_pt: com um toque sombrio!

source: Guus gets the goods!
pt_pt: O Guus percebe do assunto!

source: His new Harvest Skin hits the Seer’s Game — grab it while it’s fresh!
pt_pt: O seu novo Visual de Colheita chega ao Seer’s Game — apanha-o enquanto está fresco!

source: Tenebris awakens!
pt_pt: Tenebris desperta!

source: A brand-new Primordial Skin wraps the Titan in ancient darkness.
pt_pt: Um novo Visual Primordial envolve o Titã numa escuridão ancestral.

source: She’s alive!
pt_pt: Ela está viva!

source: And furious.
pt_pt: E furiosa.

source: Meet Electra — a stitched storm of rage.
pt_pt: Conhece a Electra — uma tempestade raivosa.

source: She comes with a Demonic Skin and her first Talisman.
pt_pt: Ela surge com um Visual Demoníaco e com o seu primeiro Talismã.

source: Electra’s not here to play.
pt_pt: A Electra não está aqui para brincar.

source: Fire Titans get an upgrade.
pt_pt: Os Titãs de Fogo recebem uma atualização.

source: Vulcan and Moloch unleash their new Biomech Skins — flame and fury!
pt_pt: Vulcão e Moloque mostram os seus novos Visuais Biomecânicos: fogo e fúria!

source: Maya gets a makeover.
pt_pt: Maya passa por uma transformação.

source: Visual update and balance tweaks are here.
pt_pt: Chegaram as atualizações visuais e os ajustes de balanceamento.

source: Starlight suit up!
pt_pt: Veste a luz das estrelas!

source: Peech shines in the Season Pass with a brand-new Star Skin.
pt_pt: Peech brilha no Passe de Temporada com um novo Visual Estelar.
